Catalogs/ВычетыНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ВычетыНДФЛ</Name>
			<Comment>(Регл)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПрименяемыйВНалоговойОтчетностиС2011Года</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПрименяемыйВНалоговойОтчетностиС2015Года</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВычета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыВычетовПоНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВычетКДоходу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПредоставляетсяНерезидентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ГруппыВычетовПоНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ГруппыВычетовПоНДФЛ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Стандартные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтандартныеНаДетей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущественные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Социальные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВычетыНДФЛ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить("ИмяПредопределенныхДанных");
	Результат.Добавить("Код");
	Результат.Добавить("ПометкаУдаления");
	
	Возврат Результат;
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьКодыВычетовНДФЛ();
	
КонецПроцедуры

Процедура ЗаполнитьКодыВычетовНДФЛ()
	
	ВычетыНДФЛ = Справочники.ВычетыНДФЛ;
	ГруппыВычетов = Перечисления.ГруппыВычетовПоНДФЛ;
	
	ОписатьКодВычетаНДФЛ("Код103", "103", "400 руб. на налогоплательщика, не относящегося к категориям, перечисленным в пп. 1-2 п. 1 ст. 218 Налогового кодекса Российской Федерации", Ложь, ГруппыВычетов.Стандартные);
	ОписатьКодВычетаНДФЛ("Код104", "104", "500 рублей на налогоплательщика, относящегося к категориям, перечисленным в пп. 2 п. 1 ст. 218 Налогового кодекса Российской Федерации", Ложь, ГруппыВычетов.Стандартные);
	ОписатьКодВычетаНДФЛ("Код105", "105", "3000 рублей на налогоплательщика, относящегося к категориям, перечисленным в пп. 1 п. 1 ст. 218 Налогового кодекса Российской Федерации", Ложь, ГруппыВычетов.Стандартные);
	ОписатьКодВычетаНДФЛ("Код108", "114 (108)", "На первого ребенка в возрасте до 18 лет, на учащегося очной формы обучения, аспиранта, ординатора, студента, курсанта в возрасте до 24 лет", Ложь, ГруппыВычетов.СтандартныеНаДетей, "114");
	ОписатьКодВычетаНДФЛ("Код109", "117 (109)", "На ребенка-инвалида до 18 лет, на учащегося очной формы обучения, аспиранта, ординатора, студента до 24 лет, явл. инвалидом I или II группы", Ложь, ГруппыВычетов.СтандартныеНаДетей,  "117");
	ОписатьКодВычетаНДФЛ("Код110", "118 (110)", "В двойном размере на первого ребенка до 18 лет, на учащегося очной формы обучения до 24 лет единственному родителю, опекуну, попечителю", Ложь, ГруппыВычетов.СтандартныеНаДетей, "118");
	ОписатьКодВычетаНДФЛ("Код111", "122 (111)", "В двойном размере на первого ребенка до 18 лет, на учащегося очной формы обучения до 24 лет при отказе второго родителя от вычета", Ложь, ГруппыВычетов.СтандартныеНаДетей, "122");
	ОписатьКодВычетаНДФЛ("Код112", "121 (112)", "В двойном размере на ребенка-инвалида до 18 лет, на учащегося очной формы обучения до 24 лет, явл. инвалидом, единственному родителю, опекуну и др.", Ложь, ГруппыВычетов.СтандартныеНаДетей, "121");
	ОписатьКодВычетаНДФЛ("Код113", "125 (113)", "В двойном размере на ребенка-инвалида до 18 лет, на учащегося очной формы обучения до 24 лет, явл. инвалидом, при отказе второго родителя от вычета", Ложь, ГруппыВычетов.СтандартныеНаДетей, "125");
	ОписатьКодВычетаНДФЛ("Код115", "115", "На второго ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, студента, курсанта в возрасте до 24", Ложь, ГруппыВычетов.СтандартныеНаДетей, "115");
	ОписатьКодВычетаНДФЛ("Код116", "116", "На третьего и каждого последующего ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, студента, к", Ложь, ГруппыВычетов.СтандартныеНаДетей, "116");
	ОписатьКодВычетаНДФЛ("Код119", "119", "В двойном размере на второго ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, студента, курсант", Ложь, ГруппыВычетов.СтандартныеНаДетей, "119");
	ОписатьКодВычетаНДФЛ("Код120", "120", "В двойном размере на третьего и каждого последующего ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ордин", Ложь, ГруппыВычетов.СтандартныеНаДетей, "120");
	ОписатьКодВычетаНДФЛ("Код123", "123", "В двойном размере на второго ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, студента, курсант", Ложь, ГруппыВычетов.СтандартныеНаДетей, "123");
	ОписатьКодВычетаНДФЛ("Код124", "124", "В двойном размере на третьего и каждого последующего ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ордин", Ложь, ГруппыВычетов.СтандартныеНаДетей, "124");
	
	ОписатьКодВычетаНДФЛ("Код201", "201", "Расходы по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг");
	ОписатьКодВычетаНДФЛ("Код202", "202", "Расходы по операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг");
	ОписатьКодВычетаНДФЛ("Код203", "203", "Расходы по операциям с ценными бумагами, не обр-мися на орг.рынке ценных бумаг, которые на момент их приобретения обр-лись на орг.рынке ценных бумаг");
	ОписатьКодВычетаНДФЛ("Код204", "204", "Убыток по опер-ям с цен.бумагами, не обр-ся на орг. рынке, которые на момент приобретения обр-сь на орг. рынке, уменьш. нал. базу доходов с кодом 1530",,,,"-");
	ОписатьКодВычетаНДФЛ("Код205", "205", "Убыток по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, уменьшающий налоговую базу доходов с кодом 1532");
	ОписатьКодВычетаНДФЛ("Код206", "206", "Расходы по доходам с кодом 1532");
	ОписатьКодВычетаНДФЛ("Код207", "207", "Расходы по доходам с кодом 1535");
	ОписатьКодВычетаНДФЛ("Код208", "208", "Убыток по опер. с фин.инстр. срочных сделок, обр-ся на орг. рынке, базисным активом которых явл. цен.бумаги, уменьш. нал. базу доходов с кодом 1530",,,,"-");
	ОписатьКодВычетаНДФЛ("Код209", "209", "Убыток по опер. с фин.инстр. ср.сделок, обр-ся на орг.рынке, базисным активом кот. не явл. цен.бумаги,  уменьш. нал. базу по опер. с фин.инстр. ср.сд.");
	
	ОписатьКодВычетаНДФЛ("Код311", "311", "Сумма, израсходованная налогоплательщиком на новое строительство либо приобретение на территории РФ жилого дома, квартиры или доли (долей) в них", Ложь, ГруппыВычетов.Имущественные);
	ОписатьКодВычетаНДФЛ("Код312", "312", "Сумма, направленная на погашение процентов по целевым займам (кредитам) на новое строительство или приобретение на территории РФ жилого дома, квартиры", Ложь, ГруппыВычетов.Имущественные);
	ОписатьКодВычетаНДФЛ("Код318", "318", "Сумма процентов по кредитам в целях перекредитования кредитов на новое строительство или приобретение на территории РФ жилого дома, квартиры", Ложь, ГруппыВычетов.Имущественные,,"312");
	ОписатьКодВычетаНДФЛ("Код319", "327", "Сумма упл-х пенс-х взносов по договору негосударственного пенсионного обеспечения и/или страх-х взносов по договору добровольного пенсионного страх-ия", Ложь, ГруппыВычетов.Социальные, "319");
	ОписатьКодВычетаНДФЛ("Код320", "328", "Сумма уплаченных дополнительных страховых взносов на накопительную часть трудовой пенсии в соответствии с Федеральным законом от 30.04.2008 № 56-ФЗ", Ложь, ГруппыВычетов.Социальные, "620");
	
 	ОписатьКодВычетаНДФЛ("Код403", "403", "Сумма фактически произведенных и документально подтвержденных расходов, связанных с выполнением работ (оказанием услуг) по договорам ГПХ");
	ОписатьКодВычетаНДФЛ("Код404", "404", "Сумма фактически произведенных и документально подтвержденных расходов, связанных с получением авторских вознаграждений");
	ОписатьКодВычетаНДФЛ("Код405", "405", "Сумма в пределах нормативов затрат, связанных с получением авторских вознаграждений");
	ОписатьКодВычетаНДФЛ("Код501", "501", "Вычет из стоимости подарков, полученных от организаций и индивидуальных предпринимателей");
	ОписатьКодВычетаНДФЛ("Код502", "502", "Вычет из стоимости призов в денежной и натуральной форме на конкурсах и соревнованиях, проводимых в соотв. с решениями Прав-ва РФ и др. органов власти");
	ОписатьКодВычетаНДФЛ("Код503", "503", "Вычет из суммы материальной помощи, оказываемой работодателями своим работникам, а также бывшим своим работникам-пенсионерам");
	ОписатьКодВычетаНДФЛ("Код504", "504", "Вычет из суммы возмещения (оплаты) работодателями своим работникам, бывшим своим работникам (пенсионерам), а также инвалидам стоимости медикаментов");
	ОписатьКодВычетаНДФЛ("Код505", "505", "Вычет из стоимости выигрышей и призов, полученных на конкурсах, играх и других мероприятиях в целях рекламы товаров (работ, услуг)");
	ОписатьКодВычетаНДФЛ("Код506", "506", "Вычет из суммы материальной помощи, оказываемой инвалидам общественными организациями инвалидов");
	ОписатьКодВычетаНДФЛ("Код507", "507", "Вычет из суммы помощи (в денежной и натуральной формах), а также стоимости подарков, полученных ветеранами, инвалидами ВОВ и приравненных к ним");
	ОписатьКодВычетаНДФЛ("МатпомощьПриРожденииРебенка", "508", "Вычет из суммы материальной помощи, оказываемой работодателями своим работникам при рождении (усыновлении) ребенка");
	ОписатьКодВычетаНДФЛ("Код509", "509", "Вычет из доходов, полученных работниками в натуральной форме в качестве оплаты труда от организаций - с/х товаропроизводителей и крестьянских х-в");
	ОписатьКодВычетаНДФЛ("Код601", "601", "Сумма, уменьшающая налоговую базу по доходам, полученным в виде дивидендов");
	ОписатьКодВычетаНДФЛ("Код607", "510", "Вычет в сумме уплаченных работодателем страховых взносов за работника на накопительную часть трудовой пенсии, но не более 12000 рублей в год",,, "607", "510");
	ОписатьКодВычетаНДФЛ("Код620", "328", "Иные суммы, уменьшающие налоговую базу в соответствии с положениями главы 23 Налогового кодекса Российской Федерации",,,"620");
	
	
КонецПроцедуры

Процедура ПерезаполнитьКодыВычетовНДФЛ_2015() Экспорт
	
	Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.ВычетыНДФЛ.Код103,"КодПрименяемыйВНалоговойОтчетностиС2015Года")) Тогда
		Возврат
	КонецЕсли;
	
	ГруппыВычетов = Перечисления.ГруппыВычетовПоНДФЛ;
	
	// с 2015 года
	ОписатьКодВычетаНДФЛ("Код318", "318", "Сумма процентов по кредитам в целях перекредитования кредитов на новое строительство или приобретение на территории РФ жилого дома, квартиры", Ложь, ГруппыВычетов.Имущественные,,"312");
	ОписатьКодВычетаНДФЛ("Код319", "327", "Сумма упл-х пенс-х взносов по договору негосударственного пенсионного обеспечения и/или страх-х взносов по договору добровольного пенсионного страх-ия", Ложь, ГруппыВычетов.Социальные, "319");
	ОписатьКодВычетаНДФЛ("Код320", "328", "Сумма уплаченных дополнительных страховых взносов на накопительную часть трудовой пенсии в соответствии с Федеральным законом от 30.04.2008 № 56-ФЗ", Ложь, ГруппыВычетов.Социальные,  "620");
	ОписатьКодВычетаНДФЛ("Код607", "510", "Вычет в сумме уплаченных работодателем страховых взносов за работника на накопительную часть трудовой пенсии, но не более 12000 рублей в год", , , "607", "510");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВычетыНДФЛ.Ссылка,
	|	ВычетыНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2011Года КАК КодПрименяемыйВНалоговойОтчетностиС2015Года
	|ИЗ
	|	Справочник.ВычетыНДФЛ КАК ВычетыНДФЛ
	|ГДЕ
	|	ВычетыНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2015Года = """"";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.КодПрименяемыйВНалоговойОтчетностиС2015Года = Выборка.КодПрименяемыйВНалоговойОтчетностиС2015Года;
		Объект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		Объект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОписатьКодВычетаНДФЛ(ИмяПредопределенныхДанных, Код, Наименование, ВычетКДоходу = Истина, ГруппаВычета = Неопределено,  Код2011 = "", Код2015 = "") 

	СсылкаПредопределенного = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВычетыНДФЛ." + ИмяПредопределенныхДанных);
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Элемент = СсылкаПредопределенного.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.ВычетыНДФЛ.СоздатьЭлемент();
		Элемент.ИмяПредопределенныхДанных = ИмяПредопределенныхДанных;
	КонецЕсли;

	Элемент.Код = Код;
	Элемент.Наименование = Наименование;
	
	Если ЗначениеЗаполнено(Код2011) Тогда
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2011Года = Код2011;
	Иначе  	
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2011Года = Элемент.Код;
	КонецЕсли;

	Если ЗначениеЗаполнено(Код2015) Тогда
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2015Года = Код2015;
	Иначе  	
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2015Года = Элемент.Код;
	КонецЕсли;

	Элемент.ВычетКДоходу = ВычетКДоходу;
	Элемент.ГруппаВычета = ГруппаВычета;

	Элемент.ОбменДанными.Загрузка = Истина;
	Элемент.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	Элемент.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
